src/DataProcessors/ВЧ_ЖурналУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ВЧ_ЖурналУведомлений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ВЧ_ОчередьУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВЧ_ОчередьУведомлений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Значение по умолчанию: "Ожидает"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВЧ_СтатусыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПопыткиОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Значение по умолчанию: "НовыйСотрудник"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Доп. данные (ФИО, телефон и т.д.)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Когда задача поставлена в очередь</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйКадровик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИДСообщения</Name>
					<Comment>Ключ уникальности (GUID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDКанала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ВЧ_ЖурналУведомлений/Forms/ВЧ_ЖурналУведомлений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ✅ ПРОВЕРКА ПРАВ ДЛЯ КНОПКИ УДАЛЕНИЯ
	// Имя кнопки берем из скриншота (СписокЗаписейУдалитьЗаписи)
	ЭтоАдмин = РольДоступна("ВЧ_АдминистраторИнтеграции") Или РольДоступна("ПолныеПрава");
	Элементы.СписокЗаписейУдалитьЗаписи.Видимость = ЭтоАдмин;

	// Проверяем, открыли ли журнал из команды документа
	Если Параметры.Свойство("СсылкаНаДокумент") И Параметры.СсылкаНаДокумент <> Неопределено Тогда
		
		Ссылка = Параметры.СсылкаНаДокумент;
		
		// ✅ Читаем дату НА СЕРВЕРЕ (безопасно и стабильно)
		Если Ссылка.Метаданные().Имя = "ПриемНаРаботу" Тогда
			ПериодОтбора.ДатаНачала = НачалоМесяца(Ссылка.Дата);
			ПериодОтбора.ДатаОкончания = КонецМесяца(Ссылка.Дата);
			ОтборДокумент = Ссылка; // Сразу ставим отбор по документу
		КонецЕсли;
		
	Иначе
		// Стандартная логика при прямом открытии из подсистемы
		Если НЕ ЗначениеЗаполнено(ПериодОтбора.ДатаНачала) Тогда
			ПериодОтбора.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
			ПериодОтбора.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	// Формируем список с учётом отборов
	СформироватьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтборы(Команда)
	ПериодОтбора.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ПериодОтбора.ДатаОкончания = КонецДня(ТекущаяДата());
	ОтборСтатус = Неопределено;
	ОтборСотрудник = Неопределено;
	ОтборДокумент = Неопределено;
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКДокументу(Команда)
	
	// Проверяем, что выбрана строка
	Если Элементы.СписокЗаписей.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите строку журнала для перехода к документу.");
		Возврат;
	КонецЕсли;
	
	// Получаем ссылку на документ-основание
	ДокументСсылка = Элементы.СписокЗаписей.ТекущиеДанные.ДокументОснование;
	
	// Проверяем, что документ заполнен
	Если ДокументСсылка = Неопределено Или ДокументСсылка.Пустая() Тогда
		ПоказатьПредупреждение(, "В выбранной записи не указан документ-основание.");
		Возврат;
	КонецЕсли;
	
	// Открываем документ в управляемом режиме (без модальности)
	ПоказатьЗначение(, ДокументСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьОтправку(Команда)
	
	Если СписокЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Создаём массив структур с двумя измерениями
	МассивКлючей = Новый Массив;
	Для Каждого Строка ИЗ СписокЗаписей Цикл
		Если Строка.Пометка И ЗначениеЗаполнено(Строка.ИДСообщения) Тогда
			Ключ = Новый Структура;
			Ключ.Вставить("ИДСообщения", Строка.ИДСообщения);
			Ключ.Вставить("IDКанала", Строка.IDКанала);
			МассивКлючей.Добавить(Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКлючей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одной строки с пометкой!");
		Возврат;
	КонецЕсли;
	
	ПовторитьОтправкуНаСервере(МассивКлючей);
	
	ПоказатьОповещениеПользователя("Заявки на повторную отправку поставлены.");
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	
	Если СписокЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Создаём массив структур с двумя измерениями
	МассивКлючей = Новый Массив;
	Для Каждого Строка ИЗ СписокЗаписей Цикл
		Если Строка.Пометка И ЗначениеЗаполнено(Строка.ИДСообщения) Тогда
			Ключ = Новый Структура;
			Ключ.Вставить("ИДСообщения", Строка.ИДСообщения);
			Ключ.Вставить("IDКанала", Строка.IDКанала);
			МассивКлючей.Добавить(Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКлючей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одной строки для удаления!");
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ПодтверждениеУдаленияЗавершено", ЭтаФорма),
		"Удалить выбранные записи из истории?",
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеУдаленияЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Повторно собираем ключи (можно оптимизировать, передав в ДополнительныеПараметры)
		МассивКлючей = Новый Массив;
		Для Каждого Строка ИЗ СписокЗаписей Цикл
			Если Строка.Пометка И ЗначениеЗаполнено(Строка.ИДСообщения) Тогда
				Ключ = Новый Структура;
				Ключ.Вставить("ИДСообщения", Строка.ИДСообщения);
				Ключ.Вставить("IDКанала", Строка.IDКанала);
				МассивКлючей.Добавить(Ключ);
			КонецЕсли;
		КонецЦикла;
		
		УдалитьЗаписиНаСервере(МассивКлючей);
		
		ПоказатьОповещениеПользователя("Записи удалены.");
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаписейУстановитьВсеПометки(Команда)
	
	Для Каждого Строка ИЗ СписокЗаписей Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаписейСнятьВсеПометки(Команда)
	
	Для Каждого Строка ИЗ СписокЗаписей Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ
////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура СформироватьНаСервере()   
	
	ЭтоАдминистратор = РольДоступна("ВЧ_АдминистраторИнтеграции") Или РольДоступна("ПолныеПрава");
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ВЧ_ОчередьУведомлений.ИДСообщения КАК ИДСообщения,
    |   ВЧ_ОчередьУведомлений.IDКанала КАК IDКанала,
    |   ВЧ_ОчередьУведомлений.ДатаСоздания КАК ДатаСоздания,
    |   ВЧ_ОчередьУведомлений.Статус КАК Статус,
    |   ВЧ_ОчередьУведомлений.ДокументОснование КАК ДокументОснование,
    |   ВЧ_ОчередьУведомлений.ТекстОшибки КАК ТекстОшибки,
    |   ВЧ_ОчередьУведомлений.ПопыткиОтправки КАК Попытки,
    |   ВЧ_ОчередьУведомлений.Сотрудник КАК Сотрудник
    |ИЗ
    |   РегистрСведений.ВЧ_ОчередьУведомлений КАК ВЧ_ОчередьУведомлений
    |ГДЕ
    |   ВЧ_ОчередьУведомлений.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
    |   И (&ОтборСтатус = ЗНАЧЕНИЕ(Перечисление.ВЧ_СтатусыУведомлений.ПустаяСсылка) ИЛИ ВЧ_ОчередьУведомлений.Статус = &ОтборСтатус)
    |   И (&ОтборДокумент = ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка) ИЛИ ВЧ_ОчередьУведомлений.ДокументОснование = &ОтборДокумент)
    |   И (&ОтборСотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) ИЛИ ВЧ_ОчередьУведомлений.Сотрудник = &ОтборСотрудник)
    |   И (ВЧ_ОчередьУведомлений.ОтветственныйКадровик = &ТекущийПользователь ИЛИ &ЭтоАдминистратор)
    |УПОРЯДОЧИТЬ ПО
    |   ДатаСоздания УБЫВ";
    
    Запрос.УстановитьПараметр("ДатаНачала", ПериодОтбора.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ПериодОтбора.ДатаОкончания);
    Запрос.УстановитьПараметр("ОтборСтатус", ?(ЗначениеЗаполнено(ОтборСтатус), ОтборСтатус, Перечисления.ВЧ_СтатусыУведомлений.ПустаяСсылка()));
    Запрос.УстановитьПараметр("ОтборДокумент", ?(ЗначениеЗаполнено(ОтборДокумент), ОтборДокумент, Документы.ПриемНаРаботу.ПустаяСсылка()));
    Запрос.УстановитьПараметр("ОтборСотрудник", ?(ЗначениеЗаполнено(ОтборСотрудник), ОтборСотрудник, Справочники.Сотрудники.ПустаяСсылка()));
    Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
    Запрос.УстановитьПараметр("ЭтоАдминистратор", ЭтоАдминистратор);
    
    СписокЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПовторитьОтправкуНаСервере(Знач МассивКлючей)
	ВЧ_ИнтеграцияСервер.ПовторитьОтправку(МассивКлючей);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиНаСервере(Знач МассивКлючей)
	ВЧ_ИнтеграцияСервер.УдалитьЗаписиИстории(МассивКлючей);
КонецПроцедуры
